/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/* --- BBS: www.STCAIMCU.com  -----------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了STC的资料及程序            */
/*---------------------------------------------------------------------*/

#ifndef	__WS2812B_DEF_H
#define __WS2812B_DEF_H

typedef enum
{
    WS2812B_Close  = 0,  //关闭状态
    WS2812B_ON_1 = 1,
    WS2812B_ON_2 = 2,
    WS2812B_ON_3 = 3,
    WS2812B_ON_4 = 4,
    WS2812B_CLS  = 5  //清屏
} WS2812B_Mode; // RGB显示模式

extern WS2812B_Mode ws2812b_mode;

// 初使化
void ws2812b_init(void);

// 主循环，写数据
void ws2812b_runLoop(void);

// 启动ws2812B 显示
void ws2812b_run(void);
void ws2812b_switch(WS2812B_Mode mode);
void ws2812b_key_next(); //按键功能切换ws2812B模式

//清屏，不显示任何颜色
void ws2812b_clear();

// 停止ws2812B 显示
void ws2812b_stop();
// 
#endif
